[
    {
      "title": "Product Support Specialist",
      "company": "ClassLink",
      "date": "June 2024 - Present",
      "responsibilities": [
        "Provide exceptional support and assistance to users of ClassLink's educational technology platform, ensuring efficient resolution of issues and inquiries.",
        "Diagnose, troubleshoot, and resolve software, hardware, and network problems, utilizing a deep understanding of ClassLink's suite of products.",
        "Collaborate with development and technical teams to escalate and resolve complex technical issues. Monitor system performance and provide feedback for improvements, ensuring optimal user experience."
      ]
    },
    {
      "title": "Admissions Ambassador",
      "company": "Marcy Lab School",
      "date": "July 2022 - Present",
      "responsibilities": [
        "Completed training in communication skills, screening for aligned values, and standardizing Code Challenge competencies.",
        "Lead technical sections of The Marcy Lab School’s interview process for applicants, screening for problem-solving skills, technical ability, and values alignment with the organization."
      ]
    },
    {
      "title": "Front Desk Receptionist",
      "company": "PaintBucket",
      "date": "May 2023 - August 2023",
      "responsibilities": [
        "Performed administrative duties such as data entry, inventory, and check-ins/outs, enhancing organizational efficiency.",
        "Provided courteous customer service, guiding customers to seating areas and serving beverages.",
        "Scheduled appointments, maintained an up-to-date calendar, and sent reminders to optimize the scheduling process."
      ]
    },
    {
      "title": "Activity Specialist",
      "company": "Brooklyn Community Services",
      "date": "October 2021 - February 2022",
      "responsibilities": [
        "Managed a class of 5-10 students ranging from K-8, overseeing their tutoring in core subjects, homework completion, and organizing weekly STEM and arts activities to enrich their learning.",
        "Monitored and tracked team tasks/responsibilities, ensuring all essential duties were completed each week."
      ]
    },
    {
      "title": "Beauty Consultant",
      "company": "Target",
      "date": "October 2020 - October 2021",
      "responsibilities": [
        "Provided tailored recommendations to enhance the customer's shopping experience.",
        "Maintained facility quality through tasks such as stocking shelves and sweeping aisles.",
        "Connected customers to effective skincare solutions, leading to increased sales, positive feedback, and enhanced store reputation."
      ]
    }
  ]
  